unit uX_kk;

interface

const

//site//////////////////////////////////////////////////////////////////////////

  kk_comment01 =                                                                '%kk[сақтық көшірме каталогы]kk%';

  kk_comment02 =                                                                '%kk[конфигурацияның ағымдағы нұсқасы]kk%';

  kk_comment03 =                                                                '%kk[барлық хабарламалар тізімі]kk%';

  kk_comment04 =                                                                '%kk[дерекқор мұрағаты]kk%';

  kk_comment05 =                                                                '%kk[дерекқор нұсқасы]kk%';

  kk_comment06 =                                                                '%kk[авторизацияланған пайдаланушылар тізімі]kk%';

  kk_comment07 =                                                                '%kk[НАЗАР АУДАРЫҢЫЗ: оператор кілті]kk%';

  kk_comment08 =                                                                '%kk[НАЗАР АУДАРЫҢЫЗ: оператор идентификаторы]kk%';

  kk_comment09 =                                                                '%kk[кілттердің бар-жоғын тексереміз]kk%';

  kk_comment10 =                                                                '%kk[кілттің бар-жоғын тексереміз]kk%';

  kk_comment11 =                                                                '%kk[басты бетке жібереміз]kk%';

  kk_comment12 =                                                                '%kk[кілттер жиынтығын оқимыз]kk%';

  kk_comment13 =                                                                '%kk[ағымдағы нұсқаны анықтаймыз]kk%';

  kk_comment14 =                                                                '%kk[оператор деректерін тексереміз]kk%';

  kk_comment15 =                                                                '%kk[файлдардың бар-жоғын тексереміз]kk%';

  kk_comment16 =                                                                '%kk[кіріс файлдарын қайта санаймыз]kk%';

  kk_comment17 =                                                                '%kk[файлдар санын тексереміз]kk%';

  kk_comment18 =                                                                '%kk[жаңа циклды бастаймыз]kk%';

  kk_comment19 =                                                                '%kk[файл атауын шығарамыз]kk%';

  kk_comment20 =                                                                '%kk[файл кеңейтімін шығарамыз]kk%';

  kk_comment21 =                                                                '%kk[файл кеңейтімін тексереміз]kk%';

  kk_comment22 =                                                                '%kk[файл өлшемін тексереміз]kk%';

  kk_comment23 =                                                                '%kk[жазу мүмкіндігін тексереміз]kk%';

  kk_comment24 =                                                                '%kk[хабарламалар санын тексереміз]kk%';

  kk_comment25 =                                                                '%kk[жылжыту нәтижесін тексереміз]kk%';

  kk_comment26 =                                                                '%kk[қажетті жолды құрамыз]kk%';

  kk_comment27 =                                                                '%kk[сақтық көшірмелерді тексереміз]kk%';

  kk_comment28 =                                                                '%kk[сақтық көшірмелерді жасырамыз]kk%';

  kk_comment29 =                                                                '%kk[кіріс файлдарын салыстырамыз]kk%';

  kk_comment30 =                                                                '%kk[мұрағат файлын жасырамыз]kk%';

  kk_comment31 =                                                                '%kk[нұсқа файлын жасырамыз]kk%';

  kk_comment32 =                                                                '%kk[тізім файлын жасырамыз]kk%';

  kk_comment33 =                                                                '%kk[бар хабарламаларды қарастырамыз]kk%';

  kk_comment34 =                                                                kk_comment12;

  kk_comment35 =                                                                kk_comment13;

  kk_comment36 =                                                                '%kk[кілттер жиынтығын салыстырамыз]kk%';

  kk_comment37 =                                                                '%kk[қонақтың рөлін тексереміз]kk%';

  kk_comment38 =                                                                '%kk[нұсқаның бар-жоғын тексереміз]kk%';

  kk_comment39 =                                                                '%kk[тізімнің бар-жоғын тексереміз]kk%';

  kk_comment40 =                                                                '%kk[мұрағаттың бар-жоғын тексереміз]kk%';

  kk_comment41 =                                                                '%kk[авторизация деректерін тексереміз]kk%';

  kk_comment42 =                                                                '%kk[нұсқаның бар-жоғын тексереміз]kk%';

  kk_comment43 =                                                                '%kk[мұрағат нұсқасын анықтаймыз]kk%';

  kk_comment44 =                                                                '%kk[мұрағат нұсқаларын салыстырамыз]kk%';

  kk_comment45 =                                                                '%kk[кілт мәнін тексереміз]kk%';

  kk_comment46 =                                                                '%kk[оператор кілтін тағайындаймыз]kk%';

  kk_comment47 =                                                                '%kk[тізімнің бар-жоғын тексереміз]kk%';

  kk_comment48 =                                                                '%kk[тізім мазмұнын жүктейміз]kk%';

  kk_comment49 =                                                                '%kk[жолдың бар-жоғын тексереміз]kk%';

  kk_comment50 =                                                                '%kk[қажетті жолды табамыз]kk%';

  kk_comment51 =                                                                '%kk[құпия сөз арқылы авторизациялаймыз]kk%';

  kk_comment52 =                                                                '%kk[мұрағаттың бар-жоғын тексереміз]kk%';

  kk_comment53 =                                                                '%kk[мұрағат жаңартуын дайындаймыз...]kk%';

  kk_comment54 =                                                                '%kk[мұрағат жаңартуын жібереміз]kk%';

//common////////////////////////////////////////////////////////////////////////

  kk_error =                                                                    '%kk[Қате]kk%';

  kk_attention =                                                                '%kk[Назар аударыңыз]kk%';

  kk_done =                                                                     '%kk[Дайын]kk%';

  kk_today =                                                                    '%kk[Бүгін]kk%';

  kk_abort =                                                                    '%kk[Тоқтату]kk%';

  kk_check =                                                                    '%kk[Тексеру]kk%';

  kk_copy =                                                                     '%kk[Көшіру]kk%';

  kk_generate =                                                                 '%kk[Құру]kk%';

  kk_continue =                                                                 '%kk[Жалғастыру]kk%';

  kk_complete =                                                                 '%kk[Аяқтау]kk%';

  kk_remove =                                                                   '%kk[Жою]kk%';

  kk_cancel =                                                                   '%kk[Болдырмау]kk%';

  kk_accept =                                                                   '%kk[Қабылдау]kk%';

  kk_decline =                                                                  '%kk[Бас тарту]kk%';

  kk_open =                                                                     '%kk[Ашу]kk%';

  kk_change =                                                                   '%kk[Өзгерту]kk%';

  kk_save =                                                                     '%kk[Сақтау]kk%';

  kk_fileNotFound =                                                             '%kk[Файл табылмады]kk%';

  kk_fileNotDecompressed =                                                      '%kk[Файл мұрағаттан шығарылмайды]kk%';

  kk_fileBusy =                                                                 '%kk[Файл басқа қолданбада ашық]kk%';

  kk_fileProtected =                                                            '%kk[Файл құпиясөзбен қорғалған]kk%';

  kk_fileWrong =                                                                '%kk[Тек XLSX форматындағы файлдарды импорттауға болады]kk%';

  kk_accountNotFound =                                                          '%kk[Аккаунт табылмады]kk%';

  kk_versionNotFound =                                                          '%kk[Нұсқа табылмады]kk%';

  kk_updateRequired =                                                           '%kk[Клиент нұсқасы сервер нұсқасымен сәйкес келмейді — соңғы нұсқаларды қолданып жатқаныңызға көз жеткізіңіз немесе жүйе әкімшісіне хабарласыңыз]kk%';

  kk_noUpdateRequired =                                                         '%kk[Жаңарту қажет емес]kk%';

  kk_noKeyIso =                                                                 '%kk["<b>CNG кілттерін оқшаулау</b>" жүйелік қызметі өшірілген — оны қосыңыз немесе жүйелік әкімшіге хабарласыңыз]kk%';

  kk_restartNeeded =                                                            '%kk["<b>CNG кілттерін оқшаулау</b>" жүйелік қызметіне дұрыс қосылу үшін қолданбаны қайта іске қосу қажет]kk%';

  kk_usersListNotFound =                                                        '%kk[Пайдаланушылар тізімі табылмады]kk%';

  kk_wrongOperator =                                                            '%kk[Мұндай деректері бар оператор тіркелгісі жүйеде табылмады — өзекті кілт файлы пайдаланылып жатқанына көз жеткізіңіз]kk%';

  kk_wrongUser =                                                                '%kk[Пайдаланушы тіркелгісі жүйеде табылмады — деректерді қайта енгізіп көріңіз немесе операторға хабарласыңыз]kk%';

  kk_archiveNotFound =                                                          '%kk[Мұрағат табылмады]kk%';

  kk_tryToDownloadAgain =                                                       '%kk[Бір нәрсе дұрыс болмады, файлды қайта жүктеп көріңіз]kk%';

  kk_tryToSyncAgain =                                                           '%kk[Бір нәрсе дұрыс болмады, қайтадан синхрондауды көріңіз]kk%';

  kk_search =                                                                   '%kk[Іздеу]kk%';

  kk_searchFilterCase =                                                         '%kk[Регистрді ескеру]kk%';

  kk_searchFilterWord =                                                         '%kk[Тек толық сөз]kk%';

  kk_searchFilterWords =                                                        '%kk[Тек толық сөздер]kk%';

  kk_lockCode =                                                                 '%kk[Бұғаттау коды]kk%';

  kk_oldLockCode =                                                              '%kk[ескі бұғаттау коды]kk%';

  kk_enterLockCode =                                                            '%kk[Бұғаттау кодын енгізіңіз]kk%';

  kk_droppedLines =                                                             '%kk[Табылған қателер тізімі]kk%';

  kk_base =                                                                     '%kk[База]kk%';

  kk_dataOperator =                                                             '%kk[Ұйым операторы]kk%';

  kk_dataOperatorNotFound =                                                     '%kk[табылмады]kk%';

  kk_dataOperatorNotExist =                                                     '%kk[Сіздің тіркелгіңіз базада жоқ — XLSX файлына өзіңіз туралы ақпаратты қосып, оны қолданбаға қайта импорттаңыз]kk%';

  kk_dataRemoveCode =                                                           '%kk[Базадан барлық деректерді жою үшін парақтың жаңа атауын көрсету керек: <b>%1</b>]kk%';

  kk_dataSource =                                                               '%kk[Деректер көзі]kk%';

  kk_dataLocal =                                                                '%kk[Жергілікті нұсқа]kk%';

  kk_dataPublic =                                                               '%kk[Жарияланған нұсқа]kk%';

  kk_dataVersion =                                                              '%kk[Ағымдағы нұсқа]kk%';

  kk_dataCount =                                                                '%kk[Жазбалар саны]kk%';

  kk_dataChanged =                                                              '%kk[Өзгерту күні]kk%';

  kk_safeMode =                                                                 '%kk[Қолданба қызмет көрсету режимінде жұмыс істейді]kk%';

  kk_fileName =                                                                 '%kk["%" файлы:]kk%';

  kk_sheetName =                                                                '%kk["%" парағы:]kk%';

  kk_wrongTable =                                                               '%kk[кесте үлгіге сәйкес келмейді ]kk%';

  kk_templateHeader =                                                           '%kk["%" тақырыбы үлгіге сәйкес келмейді ]kk%';

  kk_tooLongValue =                                                             '%kk[ [%] тым ұзын мән: ]kk%';

  kk_incorrectCount =                                                           '%kk[ [%] мәндердің қате саны]kk%';

  kk_incorrectHDBD =                                                            '%kk[ [%] жұмысқа орналасу және туған күн күндері қате: ]kk%';

  kk_incorrectBD =                                                              '%kk[ [%] туған күні қате: ]kk%';

  kk_noBD =                                                                     '%kk[ [%] туған күні көрсетілмеген]kk%';

  kk_incorrectHD =                                                              '%kk[ [%] жұмысқа орналасу күні қате: ]kk%';

  kk_noHD =                                                                     '%kk[ [%] жұмысқа орналасу күні көрсетілмеген]kk%';

  kk_noLC =                                                                     '%kk[ [%] орналасқан жері көрсетілмеген]kk%';

  kk_noSN =                                                                     '%kk[ [%] бөлімше көрсетілмеген]kk%';

  kk_incompleteEM =                                                             '%kk[ [%] электрондық пошта мекенжайы толық емес: ]kk%';

  kk_incorrectEM =                                                              '%kk[ [%] электрондық пошта мекенжайы қате: ]kk%';

  kk_incorrectFM =                                                              '%kk[ [%] бірінші ұялы телефон нөмірі қате толтырылған: ]kk%';

  kk_incorrectSM =                                                              '%kk[ [%] екінші ұялы телефон нөмірі қате толтырылған: ]kk%';

  kk_incorrectFX =                                                              '%kk[ [%] факс нөмірі қате толтырылған: ]kk%';

  kk_incorrectFW =                                                              '%kk[ [%] бірінші жұмыс телефоны нөмірі қате толтырылған: ]kk%';

  kk_incorrectSW =                                                              '%kk[ [%] екінші жұмыс телефоны нөмірі қате толтырылған: ]kk%';

  kk_noPN =                                                                     '%kk[ [%] лауазымы көрсетілмеген]kk%';

  kk_incorrectMN =                                                              '%kk[ [%] әкесінің аты қате: ]kk%';

  kk_incorrectFN =                                                              '%kk[ [%] аты қате: ]kk%';

  kk_noFN =                                                                     '%kk[ [%] аты көрсетілмеген]kk%';

  kk_incorrectLN =                                                              '%kk[ [%] тегі қате: ]kk%';

  kk_noLN =                                                                     '%kk[ [%] тегі көрсетілмеген]kk%';

//settings//////////////////////////////////////////////////////////////////////

  kk_settings =                                                                 '%kk[Баптаулар]kk%';

  kk_settingsTheme =                                                            '%kk[Безендіру]kk%';

  kk_settingsThemeSystem =                                                      '%kk[Жүйелік тақырып]kk%';

  kk_settingsThemeDark =                                                        '%kk[Қараңғы тақырып]kk%';

  kk_settingsThemeLight =                                                       '%kk[Жарық тақырып]kk%';

  kk_settingsThemeWhite =                                                       '%kk[Ақ мәтін]kk%';

  kk_settingsLocalization =                                                     '%kk[Тілдік баптау]kk%';

  kk_settingsLocalizationSystem =                                               '%kk[Жүйе тілі]kk%';

  kk_settingsProfile =                                                          '%kk[Профиль]kk%';

  kk_settingsAccount =                                                          '%kk[Тіркелгі]kk%';

  kk_settingsData =                                                             '%kk[Авторизация деректері]kk%';

  kk_settingsQuestion =                                                         '%kk[Профильді жою керек пе?]kk%';

  kk_settingsOperInfo =                                                         '%kk[Профильді жою жергілікті түрде орындалады және тіркелгіге әсер етпейді — қызметкерлердің жалпы тізімінен дербес деректерді жаһандық жою үшін бастапқы XLSX файлын өңдеу қажет]kk%';

  kk_settingsUserInfo =                                                         '%kk[Профильді жою жергілікті түрде орындалады және тіркелгіге әсер етпейді — қызметкерлердің жалпы тізімінен дербес деректерді жаһандық жою үшін ұйым операторына хабарласу керек]kk%';

  kk_settingsCurrent =                                                          '%kk[*ағымдағы:]kk%';

  kk_settingsNew =                                                              '%kk[*жаңа:]kk%';

  kk_settingsSame =                                                             '%kk[Құлыптау коды мен ПИН әртүрлі болуы керек]kk%';

  kk_settingsChanged =                                                          '%kk[Құлыптау коды сәтті өзгертілді]kk%';

//account///////////////////////////////////////////////////////////////////////

  kk_account =                                                                  '%kk[Аккаунт]kk%';

  kk_accountBufferSelf =                                                        '%kk[Сіздің авторизация деректеріңіз (ПИН және құпия сөз) алмасу буферіне көшірілді]kk%';

  kk_accountBuffer =                                                            '%kk[Пайдаланушының авторизация деректері (ПИН және құпия сөз) алмасу буферіне көшірілді]kk%';

  kk_accountState =                                                             '%kk[Күйі]kk%';

  kk_accountAvailable =                                                         '%kk[Пайдаланушы қолжетімді]kk%';

  kk_accountAvailableInfo =                                                     '%kk[Пайдаланушы <c=$00009600>қолжетімді</c> — синхрондаудан кейін оның деректері базаға түседі және ол қосымшаны пайдалана алады]kk%';

  kk_accountUnavailable =                                                       '%kk[Пайдаланушы қолжетімсіз]kk%';

  kk_accountUnavailableInfo =                                                   '%kk[Пайдаланушы <c=$001E1EE6>қолжетімсіз</c> — синхрондаудан кейін оның деректері базадан жойылады және ол қосымшаны пайдалана алмайды]kk%';

  kk_accountBlock =                                                             '%kk[Ашық қолжетімділік]kk%';

  kk_accountPasswordShort =                                                     '%kk[Құпия сөздегі таңбалардың ең аз саны: %1]kk%';

  kk_accountPasswordLower =                                                     '%kk[Кем дегенде бір кіші әріп болуы керек]kk%';

  kk_accountPasswordUpper =                                                     '%kk[Кем дегенде бір бас әріп болуы керек]kk%';

  kk_accountPasswordDigit =                                                     '%kk[Кем дегенде бір сан болуы керек]kk%';

  kk_accountPasswordSymbol =                                                    '%kk[Кем дегенде бір арнайы таңба болуы керек]kk%';

  kk_accountPasswordChangedSelf =                                               '%kk[Аккаунт құпия сөзі өзгертілді — өзгерістерді қолдану үшін базаны синхрондауды ұмытпаңыз]kk%';

  kk_accountPasswordChanged =                                                   '%kk[Аккаунт құпия сөзі өзгертілді — өзгерістерді қолдану үшін базаны синхрондауды, сондай-ақ жаңа құпия сөзді көшіріп, оны пайдаланушыға беруді ұмытпаңыз]kk%';

//company///////////////////////////////////////////////////////////////////////

  kk_companyName =                                                              '%kk[Атауы]kk%';

  kk_companyAddress =                                                           '%kk[Мекенжайы]kk%';

//details///////////////////////////////////////////////////////////////////////

  kk_firstName =                                                                '%kk[Аты]kk%';

  kk_lastName =                                                                 '%kk[Тегі]kk%';

  kk_middleName =                                                               '%kk[Әкесінің аты]kk%';

  kk_pin =                                                                      '%kk[ПИН]kk%';

  kk_password =                                                                 '%kk[Құпиясөз]kk%';

  kk_created =                                                                  '%kk[Қосылған күні]kk%';

  kk_edited =                                                                   '%kk[Өңделген күні]kk%';

  kk_announcement =                                                             '%kk[Сәлеметсіз бе, %1!' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '🔴 Teamatica қолданбасына кіру үшін жеке деректеріңіз' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '— Сайт:		%2' + sLineBreak +
                                                                                '— ПИН:		%3' + sLineBreak +
                                                                                '— Құпиясөз:	%4' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '🟡 Бұл деректерді тек Сіз білуіңіз керек — оларды ешқашан және ешкімге айтпаңыз, тіпті әріптестеріңіз, басшылық және/немесе бөгде адамдар "операторлар", "әкімшілер", "әзірлеушілер" және/немесе "қолдау қызметінің мамандары" болып сұраса да' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '🟢 Teamatica қосымшасы teamatica.org сайтында және Microsoft Store-да қолжетімді' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '🟣 Субтитрлері бар кезең-кезеңмен бейнесабақ: %6]kk%';

//wizard////////////////////////////////////////////////////////////////////////

  kk_wizardLicenseAgreement =                                                   '%kk[<s=21>ПАЙДАЛАНУШЫ КЕЛІСІМІ</s>' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                'Teamatica қолданбасын (бұдан әрі Қолданба) пайдалану шарттарымен мұқият танысыңыз:' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ПАЙДАЛАНУ ЛИЦЕНЗИЯСЫ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Қолданба пайдаланушысы (бұдан әрі Пайдаланушы) лицензиялық келісімнің (бұдан әрі Келісім) барлық шарттарын сақтаған жағдайда Қолданбаны пайдалануға айрықша емес құқық алады. Бұл құқық үшінші тұлғаларға берілмейді және/немесе сатылмайды.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ШЕКТЕУЛЕР</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Пайдаланушы Қолданба негізінде туынды шығармаларды жасауға және/немесе сатуға, Қолданбаның және/немесе оның модификацияларының бастапқы кодын декомпиляциялауға, бөлшектеуге, кері инженерияға және/немесе алудың басқа тәсілдерін жүзеге асыруға құқығы жоқ.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>КЕПІЛДІКТЕР ЖӘНЕ ЖАУАПКЕРШІЛІКТЕН БАС ТАРТУ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Қолданба «қандай болса, сондай» күйінде және ешқандай тікелей немесе жанама кепілдіксіз беріледі. Қолданба әзірлеушісі (бұдан әрі Әзірлеуші) дербес деректерге қол жеткізе алмайды, оларды жинауға, жеткізуге, сақтауға және/немесе өңдеуге қатыспайды. Әзірлеуші Пайдаланушының немесе үшінші тұлғалардың Қолданбаны пайдалану нәтижесінде келтірілген кез келген залалы, зияны немесе өзге де салдары үшін жауапты болмайды. Пайдаланушы Қолданбаны GDPR немесе ұқсас нормативтік актілерді қоса алғанда (бірақ олармен шектелмей) қолданыстағы заңнама талаптарына сәйкес қолдануға толық жауапты болады.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ЗИЯТКЕРЛІК МЕНШІК</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Қолданбаға барлық құқықтар Әзірлеушіге тиесілі.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ҚҰПИЯЛЫЛЫҚ САЯСАТЫ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Қолданба Әзірлеушіге және/немесе үшінші тұлғаларға ештеңе <c=$001E1EE6>жібермейді</c>, телеметрия және/немесе мониторинг құралдарын <c=$001E1EE6>пайдаланбайды</c>, әрекеттерді және/немесе орналасқан жерді <c=$001E1EE6>қадағаламайды</c>, кіріктірілген диагностика және/немесе талдау құралдары <c=$001E1EE6>жоқ</c>, артықшылықтарды арттыруды <c=$001E1EE6>сұрамайды</c>, статистиканы <c=$001E1EE6>жинамайды</c> және дербес деректерде <c=$001E1EE6>оқытылмайды</c>.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ҚОЛДАНЫЛАТЫН ҚҰҚЫҚ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Осы Келісім Қазақстан Республикасының заңнамасымен реттеледі.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ӨЗГЕ ЕРЕЖЕЛЕР</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Келісім алдын ала ескертусіз кез келген уақытта өзгертілуі мүмкін. Әзірлеуші Пайдаланушы оның кез келген шартын бұзған жағдайда осы Келісімнің қолданылуын тоқтатуға құқылы.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ШАРТТАРДЫ ҚАБЫЛДАУ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Қолданбаны пайдалану Пайдаланушының Келісімнің барлық шарттарымен толық келісетінін білдіреді.]kk%';

  kk_wizardCode204 =                                                            '%kk[Серверде конфигурация табылмады]kk%';

  kk_wizardCode205 =                                                            '%kk[Серверде аяқталмаған немесе зақымдалған конфигурация табылды — оны жоюдан бұрын сақтық көшірме жасап, онда маңызды деректер жоқ екеніне және оны ешкім параллель пайдаланбайтынына көз жеткізіңіз]kk%';

  kk_wizardError2 =                                                             '%kk[Robots.txt файлындағы "<b>Disallow: /teamatica/</b>" жолы дұрыс емес]kk%';

  kk_wizardError200 =                                                           '%kk[Robots.txt файлында "<b>Disallow: /teamatica/</b>" жолы табылмады]kk%';

  kk_wizardError404 =                                                           '%kk[Сайтта robots.txt файлы табылмады]kk%';

  kk_wizardTryAgain =                                                           '%kk[Teamatica.zip файлы зақымдалған — қайталап көріңіз]kk%';

  kk_wizardCorporateSite =                                                      '%kk[Сайт мекенжайы]kk%';

  kk_wizardCorporateSiteHint =                                                  '%kk[Сайт мекенжайын енгізіңіз]kk%';

  kk_wizardDemo =                                                               '%kk[Демонстрациялық режим]kk%';

  kk_wizardOperatorIdentifier =                                                 '%kk[Оператор идентификаторы]kk%';

  kk_wizardOperatorIdentifierHint =                                             '%kk[Оператор тіркелгісінің SID енгізіңіз]kk%';

//wizard/administrator//////////////////////////////////////////////////////////

  kk_wizardAdministrator =                                                      '%kk[<s=21>ҚҰРМЕТТІ ӘКІМШІ</s>' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                'Қолданбаны конфигурациялау алдында осы нұсқаулықты мұқият оқып шығыңыз:' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ЖҮЙЕЛІК ТАЛАПТАР</b> / сервер' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$001E1EE6>  ●</c>  PHP 5.5 немесе жаңарақ' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$001E1EE6>  ●</c>  Шектеусіз трафик' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<s=9>* C#, Go, JS, Python, Ruby, Rust және басқаларын қолдау — күтілуде, барлық мәліметтер github.com/teamatica сайтында</s>' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ЖҮЙЕЛІК ТАЛАПТАР</b> / клиент' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$001E1EE6>  ●</c>  Windows 10 Creators Update (1703) немесе жаңарақ' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$001E1EE6>  ●</c>  Проксисіз қатынау' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<s=9>* ARM және Windows-тың алдыңғы нұсқаларын қолдау — жоқ; Linux және macOS қолдауы — зерттелуде; Android және iOS қолдауы — енгізілуде</s>' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ТЕХНИКАЛЫҚ ШЕКТЕУЛЕР</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Қолданба ресми <b>teamatica.org</b> сайтында толығымен тегін қолжетімді — қолданбаны басқа көздерден және/немесе жарамды цифрлық қолтаңбасыз пайдаланбаңыз.' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Конфигурациялау басталғаннан кейін сайттың мекенжайын өзгерту мүмкін болмайды: яғни, егер ол басқа біреудікі немесе қате болса, процесті дереу тоқтатып, дұрыс мекенжайды көрсетіп, басынан бастау керек. URL-ді өзгертуді қажет ететін басқа атаулы сайтқа көшу, сайтты толық бақылаудан айырылу және т.б. басқа URL астында жасалған деректерді оқылмайтын етеді.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ПАЙДАЛАНУ ШАРТТАРЫ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Қолданбаның жұмысы үшін оператор қажет — қолданыстағы қызметтік міндеттеріне тағы екі міндет қосылатын ұқыпты және жауапты қызметкер:' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$001E1EE6>  1:</c>  Әр қызметкерден жұмыс берушінің дербес деректерін пайдалануға (жинау, өңдеу және сақтау) жазбаша келісімін жинау: мұндай құжатқа әдетте жұмысқа орналасу кезеңінде қол қойылады және егер оған әлі қол қойылмаған болса, онымен бастау керек (заңды проблемалар және/немесе жанжалды жағдайлардың туындауын болдырмау үшін, қызметкердің дербес деректерін пайдалануға жазбаша келісімінсіз қолданбаға қызметкердің есептік жазбасын қосу ұсынылмайды).' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$001E1EE6>  2:</c>  Кадрлық ауысулар мен тағайындауларды бақылау: жаңа есептік жазбаларды базаға қосу, өзгергендерді өңдеу және ескілерін жою.' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Қолданба "бір сайт = бір ұйым" қағидасы бойынша жұмыс істейді, бұл ретте ұйымның операторы тек бір қызметкер бола алады (мысалы, кадр бөлімінің маманы, немесе офис-менеджер, немесе хатшы). Шын мәнінде, әкімші ретінде сіздің қатысуыңыз тек бастапқы конфигурациялауға және оператор деректерін өңдеуге (егер ол өзгерсе) дейін азаяды, қалған барлығын сіздің көмегіңізсіз шешуге болады (әрине, сайт толық тәртіпте болған жағдайда).' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>РЕЗЕРВТІК КӨШІРУ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Дерекқор серверде оның жаңартуы жарияланған сайын резервтеледі. Алайда, оны қалпына келтіру мүмкіндігін арттыру үшін, серверде жасалған резервтік көшірмелердің резервтік көшірмесін кез келген ыңғайлы тәсілмен және/немесе құралмен бөгде адамдардан қорғалған және оқшауланған кез келген басқа қоймаға тұрақты резервтік көшіруді қосымша конфигурациялау ұсынылады.' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Толып кетуді болдырмау және резервтік көшірмелерді жоғалтпау үшін сервердегі бос орынның қалдығын қадағалауды ұмытпаңыз — олардың өлшемдері мен көлемдері қызметкерлер санына және жарияланымдар жиілігіне тікелей байланысты.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ҚЫЗМЕТ КӨРСЕТУ РЕЖИМІ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Оператордың авторизациясы үшін жаңа деректерді (егер оның рөлі, мысалы, басқа қызметкерге өтетін болса) арнайы қызмет көрсету режимінде жасауға болады (қолданбаны іске қосу кезінде Shift пернесін басып тұрыңыз).' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Құпиялылықты бұзбау үшін жаңа деректерді жасау және/немесе қолданыстағы деректерді тексеру үшін bcrypt-тің бөгде қызметтерін ешқашан пайдаланбаңыз.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ҚОСЫМША АҚПАРАТ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Оператордың авторизациясына арналған деректерді сенімді және жабық жерде сақтау керек, оларды ешкімге және ешқашан жарияламаңыз, тіпті бір нәрсе бұзылып, сізден "әзірлеушілер" және/немесе "қолдау қызметінің мамандары" ретінде таныстырып сұраса да.]kk%';

  kk_wizardAdministratorStep21Header =                                          '%kk[Оператор кілтін сақтаңыз]kk%';

  kk_wizardAdministratorStep21Description =                                     '%kk[Корпоративтік құпиясөздер менеджерінде]kk%';

  kk_wizardAdministratorStep22Header =                                          '%kk["teamatica" каталогының резервтік көшірмесін жасаңыз]kk%';

  kk_wizardAdministratorStep22Description =                                     '%kk[Кез келген сенімді және бөгде адамдарға қолжетімсіз жерде]kk%';

  kk_wizardAdministratorStep23Header =                                          '%kk["teamatica" каталогын сайттың түбірлік каталогына жүктеңіз]kk%';

  kk_wizardAdministratorStep23Description =                                     '%kk[Мынадай URL шығу үшін: %1/teamatica]kk%';

  kk_wizardAdministratorStep24Header =                                          '%kk["teamatica" каталогына қатынау құқықтарын орнатыңыз]kk%';

  kk_wizardAdministratorStep24Description =                                     '%kk[Ұйымда қолданыстағы ақпараттық қауіпсіздік ережелеріне сәйкес]kk%';

  kk_wizardAdministratorStep25Header =                                          '%kk["teamatica" каталогын индекстеуден жабыңыз]kk%';

  kk_wizardAdministratorStep25Description =                                     '%kk[Мазмұнды жаһандық желіде жариялаудан қорғау үшін]kk%';

  kk_wizardAdministratorStep3Hint =                                             '%kk[Тексеру үшін оператордың идентификаторын енгізіңіз (пайдаланушының SID)]kk%';

  kk_wizardAdministratorStep3Status1 =                                          '%kk[Жариялануда...]kk%';

  kk_wizardAdministratorStep3Status2 =                                          '%kk[Жүктелуде...]kk%';

  kk_wizardAdministratorStep3Status3 =                                          '%kk[Тексерілуде...]kk%';

  kk_wizardAdministratorStep3ErrorCredentials =                                 '%kk[Авторизация деректері "/teamatica/index.php" файлына сәйкес келетініне көз жеткізіңіз]kk%';

  kk_wizardAdministratorStep3ErrorFile =                                        '%kk["/teamatica/index.php" файлы сайтта бар екеніне көз жеткізіңіз, содан кейін тексеруді қайталаңыз]kk%';

  kk_wizardAdministratorStep3ErrorFolder =                                      '%kk["teamatica" каталогы сайттың түбірлік каталогында бар екеніне көз жеткізіңіз, содан кейін тексеруді қайталаңыз]kk%';

  kk_wizardAdministratorStep3ErrorSite =                                        '%kk[Сайтқа қатынау тыйым салынбағанына көз жеткізіңіз, содан кейін тексеруді қайталаңыз]kk%';

  kk_wizardAdministratorStep4Header =                                           '%kk[Қолданбаны жабыңыз және "<b>%1</b>" мекенжайы бар "Operator.key" файлын операторға жеке кез келген қорғалған және қауіпсіз тәсілмен жеткізіңіз — кілт файлы тек SID-і бұрын көрсетілген "<b>%2</b>" идентификаторына қатаң сәйкес келетін Windows есептік жазбасы үшін ғана жарамды екенін ескеріңіз.' + sLineBreak +
                                                                                sLineBreak +
                                                                                'p.s.' + sLineBreak +
                                                                                'Оператор үшін алаңдамаңыз: қолданба кілт файлын қашан және қалай пайдалану керектігін көрсетеді ;)]kk%';

//wizard/operator///////////////////////////////////////////////////////////////

  kk_wizardOperator =                                                           '%kk[<s=21>ҚҰРМЕТТІ ОПЕРАТОР</s>' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                'Бұл қосымша Сізге ұйымыңыздың қызметкерлерінің жеке деректерімен жұмысты қарапайым және ыңғайлы түрде ұйымдастыруға мүмкіндік береді — онымен жұмыс істеу кезінде төменде көрсетілген ережелерді қатаң сақтаңыз:' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Қосымшаға жүктелетін барлық жеке деректерді мұқият тексеріңіз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Деректерді қорғау және вирустармен жұқтыру қаупін азайту үшін тек қолданыстағы цифрлық қолтаңбасы бар ресми қосымшаны пайдаланыңыз — <b>teamatica.org</b> сайтынан' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Егер жұмыс орнынан уақытша кетсеңіз, құрылғыны қараусыз қалдырсаңыз және/немесе оны басқа біреудің қолына берсеңіз, қосымшаны бұғаттаңыз немесе жабыңыз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Егер Сізге өз құрылғысын жоғалтқан және/немесе авторизация үшін жеке деректері қауіпке ұшырады деп күдіктенген қызметкер хабарласса — оның құпия сөзін мүмкіндігінше тезірек өзгертіп, содан кейін оған жаңасын хабарлаңыз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Барлық құрылғыларыңызда бір бұғаттау кодын пайдаланбаңыз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Ешқашан және ешкімге жеке деректерді және/немесе Сіздің және/немесе басқа адамдардың жеке деректері бейнеленген қосымшаның скриншоттарын жібермеңіз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Ешқашан және ешкімге өзіңіздің авторизациялау деректеріңізді (кілт файлы, ПИН, құпия сөз, бұғаттау коды) айтпаңыз, тіпті бірдеңе бұзылып, "әкімшілер", "әзірлеушілер" және/немесе "қолдау қызметінің мамандары" ретінде таныстырып, сізден сұраса да' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Авторизациялау үшін жеке деректеріңізді (кілт файлы, ПИН, құпия сөз, бұғаттау коды) тек өзіңіз қол жеткізе алатын жерде сақтаңыз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Аккаунттың қауіпке ұшырауын болдырмау үшін бөтен құрылғыларда қосымшаға кірмеңіз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Қызметкер жұмыстан шыққан кезде оның есептік жазбасын дереу жойыңыз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Егер құрылғыдан мүлдем құтылсаңыз және/немесе оны жөндеуге берсеңіз, профиліңізді жойыңыз (мұны қосымша параметрлерінде және/немесе қызмет көрсету режимінде жасауға болады)' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b><c=$001E1EE6>НАЗАР АУДАРЫҢЫЗ</c></b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Қосымшаға тек жұмыс берушіге өзінің жеке деректерін пайдалануға жазбаша келісім берген қызметкерлерді ғана қосуға болады/керек]kk%';

  kk_wizardOperatorStep1Hint =                                                  '%kk[Жалғастыру үшін "Operator.key" файлын қосымшаға сүйреп апарыңыз]kk%';

  kk_wizardOperatorStep1NotFound =                                              '%kk[Кілт деректері табылмады — әкімшіңізден сізге жаңа "Operator.key" файлын жасауын сұраңыз]kk%';

  kk_wizardOperatorStep1NotMatch =                                              '%kk[Файл мазмұны дереккөзге сәйкес келмейді — әкімшіңізден сізге жаңа "Operator.key" файлын жасауын сұраңыз]kk%';

  kk_wizardOperatorStep1NotRight =                                              '%kk[Оператор идентификаторы сіздің жүйелік есептік жазбаңызбен сәйкес келмейді — әкімшіңізден сізге жаңа "Operator.key" файлын жасауын сұраңыз]kk%';

  kk_wizardOperatorStep1OnlyFor =                                               '%kk[Тек %1 үшін]kk%';

  kk_wizardOperatorStep1NoMultiple =                                            '%kk[Кілт файлдары бірнешеу бола алмайды]kk%';

  kk_wizardOperatorStep2Header =                                                '%kk[Алдымен жеке аккаунтыңызды жасау керек' + sLineBreak + sLineBreak + '<c=$00888888><s=9>* бұл хабарландыруды жасыру үшін — қосымшаның кез келген жеріне тінтуірмен басыңыз немесе кез келген пернені басыңыз</s></c>]kk%';

  kk_wizardOperatorStep2DD =                                                    '%kk[КК]kk%';

  kk_wizardOperatorStep2MM =                                                    '%kk[АА]kk%';

  kk_wizardOperatorStep2YYYY =                                                  '%kk[ЖЖЖЖ]kk%';

  kk_wizardOperatorStep2Age =                                                   '%kk[Жұмысқа қабылдану күні мен туған күннің арасындағы айырмашылық тым аз]kk%';

  kk_wizardOperatorStep2First =                                                 '%kk[Жұмысқа қабылдану күні туған күннен кейін болуы керек]kk%';

  kk_wizardOperatorStep3Header =                                                '%kk[Енді ұйымыңыздың профилін толтырыңыз]kk%';

  kk_wizardOperatorStep3CompanyHint =                                           '%kk[Ұйымыңыздың толық атауы]kk%';

  kk_wizardOperatorStep3AddressHint =                                           '%kk[Ұйымыңыздың заңды немесе нақты мекенжайы]kk%';

  kk_wizardOperatorStep4Hint =                                                  '%kk[Сенімді бұғаттау кодын ойлап табыңыз]kk%';

  kk_wizardOperatorStep4Header =                                                '%kk[Баптауды аяқтамас бұрын сенімді код ойлап табу керек — ол сізге жұмыс орнында болмаған кезде қосымшаны бұғаттау үшін қажет болады]kk%';

//wizard/user///////////////////////////////////////////////////////////////////

  kk_wizardUser =                                                               '%kk[<s=21>ҚҰРМЕТТІ ПАЙДАЛАНУШЫ</s>' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                'Бұл қолданба сіздің және басқалардың жеке деректеріне қарапайым әрі ыңғайлы қол жеткізуді қамтамасыз етеді — оны пайдалану кезінде төменде тізімделген ережелерді қатаң сақтаңыз:' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Деректерді қорғау және вирустармен зақымдану қаупін азайту үшін тек қолданыстағы цифрлық қолтаңбасы бар ресми қолданбаны пайдаланыңыз — <b>teamatica.org</b> сайтынан' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Жұмыс орнынан уақытша кеткенде, құрылғыны қараусыз қалдырғанда және/немесе оны басқа біреуге бергенде қолданбаны бұғаттаңыз немесе жабыңыз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Егер қолданбасы бар құрылғы жоғалып қалса және/немесе авторизацияға арналған жеке деректеріңіз ашылып қалды деп күдіктенсеңіз — жүйеге сіздің атыңыздан рұқсатсыз кіруді бұғаттау үшін аккаунт құпиясөзін өзгерту үшін ұйымыңыздың операторына дереу хабарласыңыз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Барлық құрылғыларыңызда бірдей бұғаттау кодын пайдаланбаңыз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Ешқашан және ешкімге жеке деректерді және/немесе сіздің және/немесе басқалардың жеке деректерінің бейнесі бар қолданба скриншоттарын жібермеңіз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Авторизацияға арналған жеке деректеріңізді (ЖСН, құпиясөз, бұғаттау коды) ешқашан және ешкімге айтпаңыз, тіпті бірдеңе бұзылып, "операторлар", "әкімшілер", "әзірлеушілер" және/немесе "қолдау қызметінің мамандары" болып таныстырып, сізден осыны сұраса да' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Авторизацияға арналған жеке деректеріңізді (ЖСН, құпиясөз, бұғаттау коды) тек өзіңіз қол жеткізе алатын жерде сақтаңыз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Аккаунттың ашылып қалуына жол бермеу үшін қолданбада бөтен құрылғыларда авторизацияланбаңыз' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Егер құрылғыдан мүлдем құтылатын болсаңыз және/немесе оны жөндеуге берсеңіз, профиліңізді жойыңыз (мұны қолданба параметрлерінде және/немесе қызмет көрсету режимінде жасауға болады)' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b><c=$001E1EE6>НАЗАР АУДАРЫҢЫЗ</c></b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Жұмыс беруші сіздің есептік жазбаңызды бұл қолданбаға тек сіздің жеке деректеріңізді пайдалануға жазбаша келісіміңізбен ғана қоса алады]kk%';

  kk_wizardUserStep1PINHint =                                                   '%kk[Жеке сәйкестендіру нөміріңізді енгізіңіз]kk%';

  kk_wizardUserStep1PasswordHint =                                              '%kk[Құпиясөзіңізді енгізіңіз]kk%';

  kk_wizardUserStep2Hint =                                                      kk_wizardOperatorStep4Hint;

  kk_wizardUserStep2Header =                                                    '%kk[Параметрлерді орнатуды аяқтамас бұрын, сенімді код ойлап табу қажет — ол сіз жұмыс орнында болмаған кезде қолданбаны бұғаттау үшін қажет болады' + sLineBreak + sLineBreak + '<c=$00888888><s=9>* осы хабарламаны жасыру үшін — қолданбаның кез келген жеріне тінтуірмен басыңыз немесе кез келген пернені басыңыз</s></c>]kk%';

//header////////////////////////////////////////////////////////////////////////

  kk_headerMenu =                                                               '%kk[Баптау]kk%';

  kk_headerSort =                                                               '%kk[Сұрыптау]kk%';

  kk_headerUpdate =                                                             '%kk[Жаңарту]kk%';

  kk_headerSync =                                                               '%kk[Синхрондау]kk%';

  kk_headerNoSync =                                                             '%kk[Синхрондау қажет емес]kk%';

  kk_headerLock =                                                               '%kk[Құлыптау]kk%';

//menu//////////////////////////////////////////////////////////////////////////

  kk_menuName =                                                                 '%kk[Қызметкер]kk%';

  kk_menuPosition =                                                             '%kk[Лауазым]kk%';

  kk_menuPhone =                                                                '%kk[Жұмыс телефоны]kk%';

  kk_menuFax =                                                                  '%kk[Факс]kk%';

  kk_menuMobile =                                                               '%kk[Ұялы телефон]kk%';

  kk_menuEmail =                                                                '%kk[Пошта]kk%';

  kk_menuSubdivision =                                                          '%kk[Бөлімше]kk%';

  kk_menuLocation =                                                             '%kk[Орналасқан жері]kk%';

  kk_menuDateHired =                                                            '%kk[Жұмысқа қабылданған күн]kk%';

  kk_menuDateBirth =                                                            '%kk[Туған күні]kk%';

  kk_menuStatus =                                                               '%kk[Ағымдағы мәртебе]kk%';

//bcrypt////////////////////////////////////////////////////////////////////////

  kk_bcryptLocal =                                                              '%kk[Локализациялауға көмектесу: %1]kk%';

  kk_bcryptWarning =                                                            '%kk[Құпиялықты сақтау үшін ешқашан сырт bcrypt қызметтерін пайдаланбаңыз]kk%';

  kk_bcryptKey =                                                                '%kk[Кілт файл]kk%';

  kk_bcryptSid =                                                                '%kk[Дұрыс SID енгізіңіз]kk%';

  kk_bcryptSafe =                                                               '%kk[Қауіпсіз жол]kk%';

  kk_bcryptLength =                                                             '%kk[Таңдауды қиындату үшін әрдайым әр түрлі ұзындықтағы үлкен жолдарды пайдаланыңыз]kk%';

  kk_bcryptBackend =                                                            '%kk[Серверлік бөлім]kk%';

  kk_bcryptTemplate =                                                           '%kk[Кесте үлгісі]kk%';

  kk_bcryptProfile =                                                            '%kk[Жергілікті профиль]kk%';

//status////////////////////////////////////////////////////////////////////////

  kk_updating =                                                                 '%kk[Жаңартылуда...]kk%';

  kk_synchronizing =                                                            '%kk[Синхрондалуда...]kk%';

  kk_connecting =                                                               '%kk[Қосылуда...]kk%';

implementation

end.