unit uX_uk;

interface

const

//site//////////////////////////////////////////////////////////////////////////

  uk_comment01 =                                                                '%uk[каталог резервного копіювання]uk%';

  uk_comment02 =                                                                '%uk[поточна версія конфігурації]uk%';

  uk_comment03 =                                                                '%uk[список всіх повідомлень]uk%';

  uk_comment04 =                                                                '%uk[архів бази даних]uk%';

  uk_comment05 =                                                                '%uk[версія бази даних]uk%';

  uk_comment06 =                                                                '%uk[список авторизованих користувачів]uk%';

  uk_comment07 =                                                                '%uk[УВАГА: ключ оператора]uk%';

  uk_comment08 =                                                                '%uk[УВАГА: ідентифікатор оператора]uk%';

  uk_comment09 =                                                                '%uk[перевіряємо наявність ключів]uk%';

  uk_comment10 =                                                                '%uk[перевіряємо наявність ключа]uk%';

  uk_comment11 =                                                                '%uk[відправляємо на головну]uk%';

  uk_comment12 =                                                                '%uk[зчитуємо набір ключів]uk%';

  uk_comment13 =                                                                '%uk[дізнаємось поточну версію]uk%';

  uk_comment14 =                                                                '%uk[перевіряємо дані оператора]uk%';

  uk_comment15 =                                                                '%uk[перевіряємо наявність файлів]uk%';

  uk_comment16 =                                                                '%uk[перераховуємо вхідні файли]uk%';

  uk_comment17 =                                                                '%uk[перевіряємо кількість файлів]uk%';

  uk_comment18 =                                                                '%uk[запускаємо новий цикл]uk%';

  uk_comment19 =                                                                '%uk[витягуємо ім''я файлу]uk%';

  uk_comment20 =                                                                '%uk[витягуємо розширення файлу]uk%';

  uk_comment21 =                                                                '%uk[перевіряємо розширення файлу]uk%';

  uk_comment22 =                                                                '%uk[перевіряємо розмір файлу]uk%';

  uk_comment23 =                                                                '%uk[перевіряємо можливість запису]uk%';

  uk_comment24 =                                                                '%uk[перевіряємо кількість повідомлень]uk%';

  uk_comment25 =                                                                '%uk[перевіряємо результат переміщення]uk%';

  uk_comment26 =                                                                '%uk[створюємо необхідний шлях]uk%';

  uk_comment27 =                                                                '%uk[перевіряємо резервні копії]uk%';

  uk_comment28 =                                                                '%uk[ховаємо резервні копії]uk%';

  uk_comment29 =                                                                '%uk[зіставляємо вхідні файли]uk%';

  uk_comment30 =                                                                '%uk[ховаємо файл архіву]uk%';

  uk_comment31 =                                                                '%uk[ховаємо файл версії]uk%';

  uk_comment32 =                                                                '%uk[ховаємо файл списку]uk%';

  uk_comment33 =                                                                '%uk[перебираємо наявні повідомлення]uk%';

  uk_comment34 =                                                                uk_comment12;

  uk_comment35 =                                                                uk_comment13;

  uk_comment36 =                                                                '%uk[порівнюємо набір ключів]uk%';

  uk_comment37 =                                                                '%uk[перевіряємо роль відвідувача]uk%';

  uk_comment38 =                                                                '%uk[перевіряємо наявність версії]uk%';

  uk_comment39 =                                                                '%uk[перевіряємо наявність списку]uk%';

  uk_comment40 =                                                                '%uk[перевіряємо наявність архіву]uk%';

  uk_comment41 =                                                                '%uk[перевіряємо дані авторизації]uk%';

  uk_comment42 =                                                                '%uk[перевіряємо наявність версії]uk%';

  uk_comment43 =                                                                '%uk[дізнаємось версію архіву]uk%';

  uk_comment44 =                                                                '%uk[порівнюємо версії архівів]uk%';

  uk_comment45 =                                                                '%uk[перевіряємо значення ключа]uk%';

  uk_comment46 =                                                                '%uk[присвоюємо ключ оператора]uk%';

  uk_comment47 =                                                                '%uk[перевіряємо наявність списку]uk%';

  uk_comment48 =                                                                '%uk[завантажуємо вміст списку]uk%';

  uk_comment49 =                                                                '%uk[перевіряємо наявність рядка]uk%';

  uk_comment50 =                                                                '%uk[знаходимо потрібний рядок]uk%';

  uk_comment51 =                                                                '%uk[авторизуємо за паролем]uk%';

  uk_comment52 =                                                                '%uk[перевіряємо наявність архіву]uk%';

  uk_comment53 =                                                                '%uk[готуємо оновлення архіву...]uk%';

  uk_comment54 =                                                                '%uk[відправляємо оновлення архіву]uk%';

//common////////////////////////////////////////////////////////////////////////

  uk_error =                                                                    '%uk[Помилка]uk%';

  uk_attention =                                                                '%uk[Увага]uk%';

  uk_done =                                                                     '%uk[Готово]uk%';

  uk_today =                                                                    '%uk[Сьогодні]uk%';

  uk_abort =                                                                    '%uk[Перервати]uk%';

  uk_check =                                                                    '%uk[Перевірити]uk%';

  uk_copy =                                                                     '%uk[Копіювати]uk%';

  uk_generate =                                                                 '%uk[Генерувати]uk%';

  uk_continue =                                                                 '%uk[Продовжити]uk%';

  uk_complete =                                                                 '%uk[Завершити]uk%';

  uk_remove =                                                                   '%uk[Видалити]uk%';

  uk_cancel =                                                                   '%uk[Скасувати]uk%';

  uk_accept =                                                                   '%uk[Прийняти]uk%';

  uk_decline =                                                                  '%uk[Відхилити]uk%';

  uk_open =                                                                     '%uk[Відкрити]uk%';

  uk_change =                                                                   '%uk[Змінити]uk%';

  uk_save =                                                                     '%uk[Зберегти]uk%';

  uk_fileNotFound =                                                             '%uk[Файл не знайдено]uk%';

  uk_fileNotDecompressed =                                                      '%uk[Файл не розпаковується]uk%';

  uk_fileBusy =                                                                 '%uk[Файл відкрито в іншому додатку]uk%';

  uk_fileProtected =                                                            '%uk[Файл захищено паролем]uk%';

  uk_fileWrong =                                                                '%uk[Імпортувати можна лише файли формату XLSX]uk%';

  uk_accountNotFound =                                                          '%uk[Обліковий запис не знайдено]uk%';

  uk_versionNotFound =                                                          '%uk[Версію не знайдено]uk%';

  uk_updateRequired =                                                           '%uk[Версія клієнта не збігається з версією сервера — будь ласка, переконайтеся, що використовуєте актуальні версії, або зверніться до вашого системного адміністратора]uk%';

  uk_noUpdateRequired =                                                         '%uk[Оновлення не потрібне]uk%';

  uk_noKeyIso =                                                                 '%uk[Системну службу "<b>Ізоляція ключів CNG</b>" вимкнено — будь ласка, увімкніть її або зверніться до Вашого системного адміністратора]uk%';

  uk_restartNeeded =                                                            '%uk[Для коректного підключення до системної служби "<b>Ізоляція ключів CNG</b>" потрібен перезапуск додатка]uk%';

  uk_usersListNotFound =                                                        '%uk[Список користувачів не знайдено]uk%';

  uk_wrongOperator =                                                            '%uk[Обліковий запис оператора з такими даними в системі не виявлено — будь ласка, переконайтеся, що використовується актуальний ключовий файл]uk%';

  uk_wrongUser =                                                                '%uk[Обліковий запис користувача в системі не знайдено — будь ласка, спробуйте ввести дані ще раз або зверніться до Вашого оператора]uk%';

  uk_archiveNotFound =                                                          '%uk[Архів не знайдено]uk%';

  uk_tryToDownloadAgain =                                                       '%uk[Щось пішло не так, спробуйте завантажити файл ще раз]uk%';

  uk_tryToSyncAgain =                                                           '%uk[Щось пішло не так, спробуйте синхронізувати ще раз]uk%';

  uk_search =                                                                   '%uk[Пошук]uk%';

  uk_searchFilterCase =                                                         '%uk[З урахуванням регістру]uk%';

  uk_searchFilterWord =                                                         '%uk[Тільки ціле слово]uk%';

  uk_searchFilterWords =                                                        '%uk[Тільки цілі слова]uk%';

  uk_lockCode =                                                                 '%uk[Код блокування]uk%';

  uk_oldLockCode =                                                              '%uk[старий код блокування]uk%';

  uk_enterLockCode =                                                            '%uk[Введіть код блокування]uk%';

  uk_droppedLines =                                                             '%uk[Список виявлених помилок]uk%';

  uk_base =                                                                     '%uk[База]uk%';

  uk_dataOperator =                                                             '%uk[Оператор організації]uk%';

  uk_dataOperatorNotFound =                                                     '%uk[не виявлено]uk%';

  uk_dataOperatorNotExist =                                                     '%uk[Ваш обліковий запис відсутній у базі — будь ласка, додайте в XLSX-файл інформацію про себе та повторно імпортуйте його в додаток]uk%';

  uk_dataRemoveCode =                                                           '%uk[Для видалення всіх даних з бази необхідно задати нову назву аркуша: <b>%1</b>]uk%';

  uk_dataSource =                                                               '%uk[Джерело даних]uk%';

  uk_dataLocal =                                                                '%uk[Локальна версія]uk%';

  uk_dataPublic =                                                               '%uk[Опублікована версія]uk%';

  uk_dataVersion =                                                              '%uk[Поточна версія]uk%';

  uk_dataCount =                                                                '%uk[Кількість записів]uk%';

  uk_dataChanged =                                                              '%uk[Дата зміни]uk%';

  uk_safeMode =                                                                 '%uk[Додаток працює в режимі обслуговування]uk%';

  uk_fileName =                                                                 '%uk[Файл "%":]uk%';

  uk_sheetName =                                                                '%uk[Аркуш "%":]uk%';

  uk_wrongTable =                                                               '%uk[таблиця не відповідає шаблону ]uk%';

  uk_templateHeader =                                                           '%uk[заголовок "%" не відповідає шаблону ]uk%';

  uk_tooLongValue =                                                             '%uk[ [%] занадто довге значення: ]uk%';

  uk_incorrectCount =                                                           '%uk[ [%] некоректна кількість значень]uk%';

  uk_incorrectHDBD =                                                            '%uk[ [%] некоректні дати працевлаштування та народження: ]uk%';

  uk_incorrectBD =                                                              '%uk[ [%] некоректна дата народження: ]uk%';

  uk_noBD =                                                                     '%uk[ [%] не вказано дату народження]uk%';

  uk_incorrectHD =                                                              '%uk[ [%] некоректна дата працевлаштування: ]uk%';

  uk_noHD =                                                                     '%uk[ [%] не вказано дату працевлаштування]uk%';

  uk_noLC =                                                                     '%uk[ [%] не вказано локацію]uk%';

  uk_noSN =                                                                     '%uk[ [%] не вказано підрозділ]uk%';

  uk_incompleteEM =                                                             '%uk[ [%] неповна адреса електронної пошти: ]uk%';

  uk_incorrectEM =                                                              '%uk[ [%] некоректна адреса електронної пошти: ]uk%';

  uk_incorrectFM =                                                              '%uk[ [%] номер першого мобільного телефону заповнено некоректно: ]uk%';

  uk_incorrectSM =                                                              '%uk[ [%] номер другого мобільного телефону заповнено некоректно: ]uk%';

  uk_incorrectFX =                                                              '%uk[ [%] номер факсу заповнено некоректно: ]uk%';

  uk_incorrectFW =                                                              '%uk[ [%] номер першого робочого телефону заповнено некоректно: ]uk%';

  uk_incorrectSW =                                                              '%uk[ [%] номер другого робочого телефону заповнено некоректно: ]uk%';

  uk_noPN =                                                                     '%uk[ [%] не вказано посаду]uk%';

  uk_incorrectMN =                                                              '%uk[ [%] некоректне по батькові: ]uk%';

  uk_incorrectFN =                                                              '%uk[ [%] некоректне ім''я: ]uk%';

  uk_noFN =                                                                     '%uk[ [%] не вказано ім''я]uk%';

  uk_incorrectLN =                                                              '%uk[ [%] некоректне прізвище: ]uk%';

  uk_noLN =                                                                     '%uk[ [%] не вказано прізвище]uk%';

//settings//////////////////////////////////////////////////////////////////////

  uk_settings =                                                                 '%uk[Налаштування]uk%';

  uk_settingsTheme =                                                            '%uk[Оформлення]uk%';

  uk_settingsThemeSystem =                                                      '%uk[Системна тема]uk%';

  uk_settingsThemeDark =                                                        '%uk[Темна тема]uk%';

  uk_settingsThemeLight =                                                       '%uk[Світла тема]uk%';

  uk_settingsThemeWhite =                                                       '%uk[Білий текст]uk%';

  uk_settingsLocalization =                                                     '%uk[Локалізація]uk%';

  uk_settingsLocalizationSystem =                                               '%uk[Мова системи]uk%';

  uk_settingsProfile =                                                          '%uk[Профіль]uk%';

  uk_settingsAccount =                                                          '%uk[Обліковий запис]uk%';

  uk_settingsData =                                                             '%uk[Дані авторизації]uk%';

  uk_settingsQuestion =                                                         '%uk[Видалити профіль?]uk%';

  uk_settingsOperInfo =                                                         '%uk[Видалення профілю відбувається локально і не впливає на обліковий запис — для глобального видалення персональних даних із загального списку співробітників необхідно редагувати вихідний XLSX-файл]uk%';

  uk_settingsUserInfo =                                                         '%uk[Видалення профілю відбувається локально і не впливає на обліковий запис — для глобального видалення персональних даних із загального списку співробітників необхідно звернутися до оператора організації]uk%';

  uk_settingsCurrent =                                                          '%uk[*поточний:]uk%';

  uk_settingsNew =                                                              '%uk[*новий:]uk%';

  uk_settingsSame =                                                             '%uk[Код блокування та ПІН повинні бути різними]uk%';

  uk_settingsChanged =                                                          '%uk[Код блокування успішно змінено]uk%';

//account///////////////////////////////////////////////////////////////////////

  uk_account =                                                                  '%uk[Обліковий запис]uk%';

  uk_accountBufferSelf =                                                        '%uk[Ваші дані для авторизації (ПІН та пароль) скопійовані в буфер обміну]uk%';

  uk_accountBuffer =                                                            '%uk[Дані для авторизації (ПІН та пароль) користувача скопійовані в буфер обміну]uk%';

  uk_accountState =                                                             '%uk[Стан]uk%';

  uk_accountAvailable =                                                         '%uk[Користувач доступний]uk%';

  uk_accountAvailableInfo =                                                     '%uk[Користувач <c=$00009600>доступний</c> — після синхронізації його дані потраплять до бази і він зможе користуватися додатком]uk%';

  uk_accountUnavailable =                                                       '%uk[Користувач недоступний]uk%';

  uk_accountUnavailableInfo =                                                   '%uk[Користувач <c=$001E1EE6>недоступний</c> — після синхронізації його дані зникнуть з бази і він не зможе користуватися додатком]uk%';

  uk_accountBlock =                                                             '%uk[Відкритий доступ]uk%';

  uk_accountPasswordShort =                                                     '%uk[Мінімальна кількість символів у паролі: %1]uk%';

  uk_accountPasswordLower =                                                     '%uk[Має бути хоча б одна рядкова літера]uk%';

  uk_accountPasswordUpper =                                                     '%uk[Має бути хоча б одна велика літера]uk%';

  uk_accountPasswordDigit =                                                     '%uk[Має бути хоча б одна цифра]uk%';

  uk_accountPasswordSymbol =                                                    '%uk[Має бути хоча б один спеціальний символ]uk%';

  uk_accountPasswordChangedSelf =                                               '%uk[Пароль облікового запису змінено — не забудьте синхронізувати базу для застосування змін]uk%';

  uk_accountPasswordChanged =                                                   '%uk[Пароль облікового запису змінено — не забудьте синхронізувати базу для застосування змін, а також скопіювати новий пароль та передати його користувачу]uk%';

//company///////////////////////////////////////////////////////////////////////

  uk_companyName =                                                              '%uk[Назва]uk%';

  uk_companyAddress =                                                           '%uk[Адреса]uk%';

//details///////////////////////////////////////////////////////////////////////

  uk_firstName =                                                                '%uk[Ім''я]uk%';

  uk_lastName =                                                                 '%uk[Прізвище]uk%';

  uk_middleName =                                                               '%uk[По батькові]uk%';

  uk_pin =                                                                      '%uk[ПІН]uk%';

  uk_password =                                                                 '%uk[Пароль]uk%';

  uk_created =                                                                  '%uk[Дата додавання]uk%';

  uk_edited =                                                                   '%uk[Дата редагування]uk%';

  uk_announcement =                                                             '%uk[Вітаємо, %1!' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '🔴 Ваші особисті дані для авторизації в додатку Teamatica' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '— Сайт:		%2' + sLineBreak +
                                                                                '— ПІН:		%3' + sLineBreak +
                                                                                '— Пароль:	%4' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '🟡 Ці дані маєте знати лише Ви — будь ласка, ніколи й нікому не розголошуйте їх, навіть якщо про це Вас просять колеги, керівництво та/або взагалі сторонні люди, які представляються "операторами", "адміністраторами", "розробниками" та/або "фахівцями служби підтримки"' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '🟢 Додаток Teamatica доступний на сайті %5 та в Microsoft Store' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '' + sLineBreak +
                                                                                '🟣 Покрокова відеоінструкція з субтитрами: %6]uk%';

//wizard////////////////////////////////////////////////////////////////////////

  uk_wizardLicenseAgreement =                                                   '%uk[<s=21>КОРИСТУВАЦЬКА УГОДА</s>' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                'Будь ласка, уважно ознайомтеся з умовами використання додатку Teamatica (далі Додаток):' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ЛІЦЕНЗІЯ НА ВИКОРИСТАННЯ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Користувач Додатку (далі Користувач) отримує невиключне право на використання Додатку при дотриманні всіх умов ліцензійної угоди (далі Угода). Це право не може бути передано та/або продано третім особам.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ОБМЕЖЕННЯ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Користувач не має права створювати та/або продавати похідні твори на основі Додатку, здійснювати декомпіляцію, дизасемблювання, реверс-інжиніринг та/або інші способи отримання вихідного коду Додатку та/або його модифікацій.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ГАРАНТІЇ ТА ВІДМОВА ВІД ВІДПОВІДАЛЬНОСТІ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Додаток надається «як є» і без будь-яких явних або неявних гарантій. Розробник Додатку (далі Розробник) не має доступу до персональних даних, не бере участі в їх зборі, доставці, зберіганні та/або обробці. Розробник не несе відповідальності за будь-які збитки, шкоду або інші наслідки, понесені Користувачем або третіми особами в результаті використання Додатку. Користувач несе повну відповідальність за застосування Додатку відповідно до вимог чинного законодавства, включаючи (але не обмежуючись) GDPR або аналогічні нормативні акти.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ІНТЕЛЕКТУАЛЬНА ВЛАСНІСТЬ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Усі права на Додаток належать Розробнику.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Додаток нічого <c=$001E1EE6>не передає</c> Розробнику та/або третім особам, <c=$001E1EE6>не використовує</c> інструменти телеметрії та/або моніторингу, <c=$001E1EE6>не відстежує</c> дії та/або місцезнаходження, <c=$001E1EE6>не має</c> вбудованих засобів діагностики та/або аналітики, <c=$001E1EE6>не запитує</c> підвищення привілеїв, <c=$001E1EE6>не збирає</c> статистику та <c=$001E1EE6>не навчається</c> на персональних даних.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ЗАСТОСОВНЕ ПРАВО</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Ця Угода регулюється законодавством Республіки Казахстан.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ІНШІ ПОЛОЖЕННЯ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Угода може бути змінена в будь-який час без попереднього повідомлення. Розробник має право припинити дію цієї Угоди при порушенні Користувачем будь-якої з її умов.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ПРИЙНЯТТЯ УМОВ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Використання Додатку означає повну згоду Користувача з усіма умовами Угоди.]uk%';

  uk_wizardCode204 =                                                            '%uk[Конфігурацію на сервері не виявлено]uk%';

  uk_wizardCode205 =                                                            '%uk[На сервері виявлено незавершену або пошкоджену конфігурацію — перед її видаленням обов''язково зробіть резервну копію та переконайтеся, що в ній відсутні важливі дані та вона ніким паралельно не використовується]uk%';

  uk_wizardError2 =                                                             '%uk[Рядок "<b>Disallow: /teamatica/</b>" у файлі robots.txt некоректний]uk%';

  uk_wizardError200 =                                                           '%uk[Рядок "<b>Disallow: /teamatica/</b>" у файлі robots.txt не знайдено]uk%';

  uk_wizardError404 =                                                           '%uk[Файл robots.txt на сайті не знайдено]uk%';

  uk_wizardTryAgain =                                                           '%uk[Файл teamatica.zip пошкоджений — будь ласка, спробуйте ще раз]uk%';

  uk_wizardCorporateSite =                                                      '%uk[Адреса сайту]uk%';

  uk_wizardCorporateSiteHint =                                                  '%uk[Введіть адресу сайту]uk%';

  uk_wizardDemo =                                                               '%uk[Демонстраційний режим]uk%';

  uk_wizardOperatorIdentifier =                                                 '%uk[Ідентифікатор оператора]uk%';

  uk_wizardOperatorIdentifierHint =                                             '%uk[Введіть SID облікового запису оператора]uk%';

//wizard/administrator//////////////////////////////////////////////////////////

  uk_wizardAdministrator =                                                      '%uk[<s=21>ШАНОВНИЙ АДМІНІСТРАТОР</s>' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                'Будь ласка, перед налаштуванням застосунку уважно ознайомтеся з цією інструкцією:' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>СИСТЕМНІ ВИМОГИ</b> / сервер' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$001E1EE6>  ●</c>  PHP 5.5 або новіше' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$001E1EE6>  ●</c>  Трафік без ліміту' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<s=9>* підтримка C#, Go, JS, Python, Ruby, Rust та інших — очікується, всі подробиці на github.com/teamatica</s>' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>СИСТЕМНІ ВИМОГИ</b> / клієнт' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$001E1EE6>  ●</c>  Windows 10 Creators Update (1703) або новіше' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$001E1EE6>  ●</c>  Доступ без проксі' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<s=9>* підтримка ARM та попередніх версій Windows — відсутня; підтримка Linux та macOS — вивчається; підтримка Android та iOS — впроваджується</s>' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ТЕХНІЧНІ ОБМЕЖЕННЯ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Застосунок доступний на офіційному сайті <b>teamatica.org</b> абсолютно безкоштовно — не користуйтеся застосунком з інших джерел та/або без дійсного цифрового підпису.' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Після початку налаштування змінити адресу сайту вже не вдасться: тобто якщо він є чужим або помилковим, слід негайно перервати процес і почати все спочатку, вказавши коректну адресу. Врахуйте, що переїзд на сайт з іншим іменем, повна втрата контролю над сайтом, і взагалі все, що тягне за собою зміну URL, робить дані, створені під іншим URL, нечитабельними.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>УМОВИ ЕКСПЛУАТАЦІЇ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Для роботи застосунку потрібен оператор — охайний та відповідальний працівник, до наявних службових обов\''язків якого додадуться ще два:' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$001E1EE6>  1:</c>  Збір з кожного співробітника письмової згоди на використання (збір, обробку та зберігання) роботодавцем персональних даних: такий документ, як правило, підписується на етапі працевлаштування, і якщо він досі не був підписаний, то почати слід саме з нього (щоб уникнути виникнення юридичних проблем та/або конфліктних ситуацій, додавати в застосунок обліковий запис співробітника без його письмової згоди на використання його персональних даних не рекомендується).' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$001E1EE6>  2:</c>  Моніторинг кадрових перестановок та призначень: додавання до бази нових облікових записів, редагування змінених та видалення застарілих.' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Застосунок працює за принципом "один сайт = одна організація", при цьому оператором організації може бути тільки один працівник (наприклад, спеціаліст відділу кадрів, або офіс-менеджер, або секретар). По суті, Ваша участь як адміністратора зводиться лише до стартового налаштування та до редагування даних оператора (якщо він змінюється), все інше можна розрулити без Вашої допомоги (звісно, за умови, що сайт у повному порядку).' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>РЕЗЕРВНЕ КОПІЮВАННЯ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'База даних резервується на сервері при кожній публікації її оновлення. Однак, для збільшення шансів її відновлення, наполегливо рекомендується додатково налаштувати на сервері регулярне резервне копіювання вже створених резервних копій будь-яким зручним способом та/або інструментом у будь-яке інше захищене та ізольоване від сторонніх сховище.' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Не забувайте відстежувати залишок вільного простору на сервері, щоб уникнути переповнення та не втратити резервні копії — їх розміри та обсяги безпосередньо залежать від кількості співробітників та частоти публікацій.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>РЕЖИМ ОБСЛУГОВУВАННЯ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Нові дані для авторизації оператора (якщо його роль, наприклад, переходить до іншого співробітника) можна згенерувати в спеціальному режимі обслуговування (утримуйте клавішу Shift під час запуску застосунку).' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Щоб уникнути компрометації ніколи не користуйтеся сторонніми сервісами bcrypt для генерації нових та/або перевірки існуючих даних.' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b>ДОДАТКОВА ІНФОРМАЦІЯ</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Дані для авторизації оператора необхідно зберігати в надійному та закритому місці, нікому і ніколи не розголошуйте їх, навіть якщо щось зламалося і Вас просять про це, представляючись "розробниками" та/або "спеціалістами служби підтримки".]uk%';

  uk_wizardAdministratorStep21Header =                                          '%uk[Збережіть ключ оператора]uk%';

  uk_wizardAdministratorStep21Description =                                     '%uk[У корпоративному менеджері паролів]uk%';

  uk_wizardAdministratorStep22Header =                                          '%uk[Створіть резервну копію каталогу "teamatica"]uk%';

  uk_wizardAdministratorStep22Description =                                     '%uk[У будь-якому надійному та недоступному стороннім особам місці]uk%';

  uk_wizardAdministratorStep23Header =                                          '%uk[Завантажте каталог "teamatica" до кореня сайту]uk%';

  uk_wizardAdministratorStep23Description =                                     '%uk[Щоб вийшов такий URL: %1/teamatica]uk%';

  uk_wizardAdministratorStep24Header =                                          '%uk[Встановіть права доступу до каталогу "teamatica"]uk%';

  uk_wizardAdministratorStep24Description =                                     '%uk[Відповідно до чинних в організації правил ІБ]uk%';

  uk_wizardAdministratorStep25Header =                                          '%uk[Закрийте каталог "teamatica" від індексації]uk%';

  uk_wizardAdministratorStep25Description =                                     '%uk[Для захисту вмісту від публікації в глобальній мережі]uk%';

  uk_wizardAdministratorStep3Hint =                                             '%uk[Введіть для перевірки ідентифікатор оператора (SID користувача)]uk%';

  uk_wizardAdministratorStep3Status1 =                                          '%uk[Публікуємо...]uk%';

  uk_wizardAdministratorStep3Status2 =                                          '%uk[Завантажуємо...]uk%';

  uk_wizardAdministratorStep3Status3 =                                          '%uk[Перевіряємо...]uk%';

  uk_wizardAdministratorStep3ErrorCredentials =                                 '%uk[Переконайтеся, що дані для авторизації відповідають файлу "/teamatica/index.php"]uk%';

  uk_wizardAdministratorStep3ErrorFile =                                        '%uk[Переконайтеся, що файл "/teamatica/index.php" присутній на сайті, після чого повторіть перевірку]uk%';

  uk_wizardAdministratorStep3ErrorFolder =                                      '%uk[Переконайтеся, що каталог "teamatica" присутній у корені сайту, після чого повторіть перевірку]uk%';

  uk_wizardAdministratorStep3ErrorSite =                                        '%uk[Переконайтеся, що доступ до сайту не заборонений, після чого повторіть перевірку]uk%';

  uk_wizardAdministratorStep4Header =                                           '%uk[Закрийте застосунок та передайте файл "Operator.key" з адресою "<b>%1</b>" особисто оператору будь-яким захищеним та безпечним способом — будь ласка, майте на увазі, що ключовий файл дійсний тільки для того облікового запису Windows, SID якого строго відповідає вказаному раніше ідентифікатору "<b>%2</b>".' + sLineBreak
                                                                                + sLineBreak +
                                                                                'p.s.' + sLineBreak +
                                                                                'За оператора не хвилюйтеся: застосунок підкаже, коли і як використовувати ключовий файл ;)]uk%';

//wizard/operator///////////////////////////////////////////////////////////////

  uk_wizardOperator =                                                           '%uk[<s=21>ШАНОВНИЙ ОПЕРАТОР</s>' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                'Цей додаток надає Вам можливість просто та зручно організувати роботу з персональними даними співробітників Вашої організації — будь ласка, під час роботи з ним суворо дотримуйтесь перелічених нижче правил:' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Ретельно перевіряйте всі персональні дані, що завантажуються в додаток' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  З метою захисту даних та мінімізації ризиків зараження вірусами, користуйтеся лише офіційним додатком з чинним цифровим підписом — з сайту <b>teamatica.org</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Блокуйте або закривайте додаток, якщо тимчасово залишаєте робоче місце, залишаєте пристрій без нагляду та/або передаєте його в чужі руки' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Якщо до Вас звернувся співробітник, який втратив свій пристрій та/або підозрює, що його особисті дані для авторизації скомпрометовані — якнайшвидше змініть його пароль, після чого повідомте йому новий' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Не використовуйте один і той самий код блокування на всіх своїх пристроях' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Ніколи й нікому не пересилайте персональні дані та/або скріншоти додатка із зображенням Ваших та/або чужих персональних даних' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Ніколи й нікому не розголошуйте свої особисті дані для авторизації (ключовий файл, ПІН, пароль, код блокування), навіть якщо щось зламалося і Вас просять про це, представляючись "адміністраторами", "розробниками" та/або "фахівцями служби підтримки"' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Зберігайте свої особисті дані для авторизації (ключовий файл, ПІН, пароль, код блокування) у такому місці, доступ до якого маєте виключно Ви' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Не авторизуйтеся в додатку на чужих пристроях, щоб уникнути компрометації облікового запису' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  При звільненні співробітника негайно знищуйте його обліковий запис' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Видаляйте свій профіль (це можна зробити в налаштуваннях додатка та/або в режимі обслуговування), якщо позбуваєтеся пристрою назавжди та/або здаєте його в ремонт' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b><c=$001E1EE6>УВАГА</c></b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'В додаток можна/потрібно додавати тільки тих співробітників, які надали роботодавцю письмову згоду на використання своїх персональних даних]uk%';

  uk_wizardOperatorStep1Hint =                                                  '%uk[Для продовження перетягніть файл "Operator.key" на додаток]uk%';

  uk_wizardOperatorStep1NotFound =                                              '%uk[Ключові дані не виявлено — будь ласка, попросіть Вашого адміністратора сформувати для Вас новий файл "Operator.key"]uk%';

  uk_wizardOperatorStep1NotMatch =                                              '%uk[Вміст файлу не відповідає джерелу — будь ласка, попросіть Вашого адміністратора сформувати для Вас новий файл "Operator.key"]uk%';

  uk_wizardOperatorStep1NotRight =                                              '%uk[Ідентифікатор оператора не збігається з Вашим системним обліковим записом — будь ласка, попросіть Вашого адміністратора сформувати для Вас новий файл "Operator.key"]uk%';

  uk_wizardOperatorStep1OnlyFor =                                               '%uk[Тільки для %1]uk%';

  uk_wizardOperatorStep1NoMultiple =                                            '%uk[Ключових файлів не може бути декілька]uk%';

  uk_wizardOperatorStep2Header =                                                '%uk[Спочатку потрібно створити Ваш персональний обліковий запис' + sLineBreak + sLineBreak + '<c=$00888888><s=9>* щоб приховати це повідомлення — клацніть мишкою в будь-яке місце додатка або натисніть будь-яку клавішу</s></c>]uk%';

  uk_wizardOperatorStep2DD =                                                    '%uk[ДД]uk%';

  uk_wizardOperatorStep2MM =                                                    '%uk[ММ]uk%';

  uk_wizardOperatorStep2YYYY =                                                  '%uk[РРРР]uk%';

  uk_wizardOperatorStep2Age =                                                   '%uk[Різниця між датами працевлаштування та народження занадто мала]uk%';

  uk_wizardOperatorStep2First =                                                 '%uk[Дата працевлаштування має бути пізніше дати народження]uk%';

  uk_wizardOperatorStep3Header =                                                '%uk[Тепер заповніть, будь ласка, профіль Вашої організації]uk%';

  uk_wizardOperatorStep3CompanyHint =                                           '%uk[Повне найменування Вашої організації]uk%';

  uk_wizardOperatorStep3AddressHint =                                           '%uk[Юридична або фактична адреса Вашої організації]uk%';

  uk_wizardOperatorStep4Hint =                                                  '%uk[Придумайте надійний код блокування]uk%';

  uk_wizardOperatorStep4Header =                                                '%uk[Перед завершенням налаштування необхідно придумати надійний код — він знадобиться Вам для блокування додатка на час Вашої відсутності на робочому місці]uk%';

//wizard/user///////////////////////////////////////////////////////////////////

  uk_wizardUser =                                                               '%uk[<s=21>ШАНОВНИЙ КОРИСТУВАЧ</s>' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                'Цей додаток надає простий та зручний доступ до Ваших та чужих персональних даних — будь ласка, під час роботи з ним суворо дотримуйтесь перелічених нижче правил:' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  З метою захисту даних та мінімізації ризиків зараження вірусами, користуйтеся лише офіційним додатком з дійсним цифровим підписом — з сайту <b>teamatica.org</b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Блокуйте або закривайте додаток, якщо тимчасово залишаєте робоче місце, залишаєте пристрій без нагляду та/або передаєте його в чужі руки' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Якщо пристрій з додатком втрачено та/або у Вас є підозра, що Ваші особисті дані для авторизації скомпрометовано — негайно зверніться до оператора Вашої організації для зміни пароля облікового запису, щоб заблокувати несанкціонований доступ до системи від Вашого імені' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Не використовуйте один і той самий код блокування на всіх своїх пристроях' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Ніколи й нікому не пересилайте персональні дані та/або скріншоти додатка із зображенням Ваших та/або чужих персональних даних' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Ніколи й нікому не розголошуйте свої особисті дані для авторизації (ПІН, пароль, код блокування), навіть якщо щось зламалося і Вас просять про це, представляючись "операторами", "адміністраторами", "розробниками" та/або "фахівцями служби підтримки"' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Зберігайте свої особисті дані для авторизації (ПІН, пароль, код блокування) в такому місці, доступ до якого маєте тільки Ви' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Не авторизуйтесь у додатку на чужих пристроях, щоб уникнути компрометації облікового запису' + sLineBreak +
                                                                                sLineBreak +
                                                                                '<c=$00FF9B37>  ●</c>  Видаляйте свій профіль (це можна зробити в налаштуваннях додатка та/або в режимі обслуговування), якщо позбуваєтесь пристрою назавжди та/або здаєте його в ремонт' + sLineBreak +
                                                                                sLineBreak +
                                                                                sLineBreak +
                                                                                '<b><c=$001E1EE6>УВАГА</c></b>' + sLineBreak +
                                                                                sLineBreak +
                                                                                'Роботодавець може додати Ваш обліковий запис у цей додаток тільки з Вашої письмової згоди на використання Ваших персональних даних]uk%';

  uk_wizardUserStep1PINHint =                                                   '%uk[Введіть Ваш персональний ідентифікаційний номер]uk%';

  uk_wizardUserStep1PasswordHint =                                              '%uk[Введіть Ваш пароль]uk%';

  uk_wizardUserStep2Hint =                                                      uk_wizardOperatorStep4Hint;

  uk_wizardUserStep2Header =                                                    '%uk[Перед завершенням налаштування необхідно придумати надійний код — він знадобиться Вам для блокування додатка на час Вашої відсутності на робочому місці' + sLineBreak + sLineBreak + '<c=$00888888><s=9>* щоб приховати це повідомлення — клацніть мишкою в будь-яке місце додатка або натисніть будь-яку клавішу</s></c>]uk%';

//header////////////////////////////////////////////////////////////////////////

  uk_headerMenu =                                                               '%uk[Налаштувати]uk%';

  uk_headerSort =                                                               '%uk[Сортувати]uk%';

  uk_headerUpdate =                                                             '%uk[Оновити]uk%';

  uk_headerSync =                                                               '%uk[Синхронізувати]uk%';

  uk_headerNoSync =                                                             '%uk[Синхронізація не потрібна]uk%';

  uk_headerLock =                                                               '%uk[Блокувати]uk%';

//menu//////////////////////////////////////////////////////////////////////////

  uk_menuName =                                                                 '%uk[Співробітник]uk%';

  uk_menuPosition =                                                             '%uk[Посада]uk%';

  uk_menuPhone =                                                                '%uk[Робочий телефон]uk%';

  uk_menuFax =                                                                  '%uk[Факс]uk%';

  uk_menuMobile =                                                               '%uk[Мобільний телефон]uk%';

  uk_menuEmail =                                                                '%uk[Пошта]uk%';

  uk_menuSubdivision =                                                          '%uk[Підрозділ]uk%';

  uk_menuLocation =                                                             '%uk[Розташування]uk%';

  uk_menuDateHired =                                                            '%uk[Дата працевлаштування]uk%';

  uk_menuDateBirth =                                                            '%uk[Дата народження]uk%';

  uk_menuStatus =                                                               '%uk[Поточний статус]uk%';

//bcrypt////////////////////////////////////////////////////////////////////////

  uk_bcryptLocal =                                                              '%uk[Допомогти з локалізацією: %1]uk%';

  uk_bcryptWarning =                                                            '%uk[Щоб уникнути компрометації ніколи не користуйтесь сторонніми сервісами bcrypt]uk%';

  uk_bcryptKey =                                                                '%uk[Ключовий файл]uk%';

  uk_bcryptSid =                                                                '%uk[Будь ласка, введіть коректний SID]uk%';

  uk_bcryptSafe =                                                               '%uk[Безпечний рядок]uk%';

  uk_bcryptLength =                                                             '%uk[Для ускладнення підбору завжди використовуйте великі рядки різної довжини]uk%';

  uk_bcryptBackend =                                                            '%uk[Серверна частина]uk%';

  uk_bcryptTemplate =                                                           '%uk[Шаблон таблиці]uk%';

  uk_bcryptProfile =                                                            '%uk[Локальний профіль]uk%';

//status////////////////////////////////////////////////////////////////////////

  uk_updating =                                                                 '%uk[Оновлення...]uk%';

  uk_synchronizing =                                                            '%uk[Синхронізація...]uk%';

  uk_connecting =                                                               '%uk[Підключення...]uk%';

implementation

end.